IRP/src/DataProcessors/PointOfSale/PointOfSale.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
 <name>PointOfSale</name>
 <attributes>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>Discount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>Cashback</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>CustomerCash</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>Workstation</name>
  <type>
   <types>CatalogRef.Workstations</types>
  </type>
 </attributes>
 <attributes>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
</mdclass:DataProcessor>

IRP/src/AccumulationRegisters/R3050T_PosCashBalances/R3050T_PosCashBalances.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R3050T_PosCashBalances</name>
 <registerType>Turnovers</registerType>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>Commission</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Account</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PaymentType</name>
  <type>
   <types>CatalogRef.PaymentTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PaymentTerminal</name>
  <type>
   <types>CatalogRef.PaymentTerminals</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R3010B_CashOnHand/R3010B_CashOnHand.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R3010B_CashOnHand</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Account</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/PaymentTypes/PaymentTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>PaymentTypes</name>
 <enumValues>
  <name>Cash</name>
 </enumValues>
 <enumValues>
  <name>Card</name>
 </enumValues>
 <enumValues>
  <name>PaymentAgent</name>
 </enumValues>
 <enumValues>
  <name>Advance</name>
 </enumValues>
 <enumValues>
  <name>Certificate</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/PaymentTypes/PaymentTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PaymentTypes</name>
 <hierarchical>true</hierarchical>
 <hierarchyType>HierarchyOfItems</hierarchyType>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.PaymentTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Icon</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>isIconSet</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>FinancialMovementType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/DataProcessors/PointOfSale/Forms/SessionClosing/Module.bsl
// @strict-types

#Region Form

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ThisObject.Currency = Parameters.Currency;
	ThisObject.Store = Parameters.Store;
	ThisObject.Workstation = Parameters.Workstation;
	ThisObject.ConsolidatedRetailSales = Parameters.ConsolidatedRetailSales; 
	
	CRS_Attributes = CommonFunctionsServer.GetAttributesFromRef(
			ThisObject.ConsolidatedRetailSales, "Company, Branch, CashAccount, OpeningDate");
	FillPropertyValues(ThisObject, CRS_Attributes);
	
	LoadSessionData();
	
	ThisObject.Items.ClosingPages.PagesRepresentation = FormPagesRepresentation.None;
	SetCurrentPage();
	
EndProcedure

&AtServer
Procedure LoadSessionData()
	
	SetExistingWarningDocuments();
	ReadCashOperations();
	ReadTerminalOperations();
	ReadBalanceData();
	
EndProcedure

&AtServer
Procedure SetCurrentPage()

	If WarningDocumentsAreExisted Then
		ChangePage(ThisObject.Items.WarningsPage, ThisObject);
		Return; 
	EndIf;
	
	areAmountsEqual = True;
	For Each TableItem In CashTable Do
		If Not TableItem.AmountInBase = TableItem.AmountInRegister Then
			areAmountsEqual = False;
			Break;
		EndIf;
	EndDo;
	If Not areAmountsEqual And Not CashConfirm Then
		ChangePage(ThisObject.Items.CashboxesPage, ThisObject);
		Return;
	EndIf;
	
	areAmountsEqual = True;
	For Each TableItem In TerminalTable Do
		If Not TableItem.AmountInBase = TableItem.AmountInTerminal Then
			areAmountsEqual = False;
			Break;
		EndIf;
	EndDo;
	If Not areAmountsEqual And Not TerminalConfirm Then
		ChangePage(ThisObject.Items.TerminalsPage, ThisObject);
		Return;
	EndIf;
	
	If Not BalanceEnd = BalanceReal And Not BalanceConfirm Then
		ChangePage(ThisObject.Items.BalancePage, ThisObject);
		Return;
	EndIf;
	
	ChangePage(ThisObject.Items.FinishPage, ThisObject);

EndProcedure

&AtClient
Procedure PreviousPage(Command)
	
	If ThisObject.Items.ClosingPages.CurrentPage = ThisObject.Items.FinishPage Then
		ChangePage(ThisObject.Items.BalancePage, ThisObject);
	ElsIf ThisObject.Items.ClosingPages.CurrentPage = ThisObject.Items.BalancePage Then
		ChangePage(ThisObject.Items.TerminalsPage, ThisObject);
	ElsIf ThisObject.Items.ClosingPages.CurrentPage = ThisObject.Items.TerminalsPage Then
		ChangePage(ThisObject.Items.CashboxesPage, ThisObject);
	EndIf;
	
EndProcedure

// Change page.
// 
// Parameters:
//  Page - FormGroup - Page
//  Form - ClientApplicationForm - Form
&AtClientAtServerNoContext
Procedure ChangePage(Page, Form)
	Form.Items.ClosingPages.CurrentPage = Page;
	Form.Title = Page.Title;
EndProcedure
	
&AtClient
Procedure CloseSession(Command)
	Close(DialogReturnCode.OK);
EndProcedure

#EndRegion

#Region Warnings

// Set existing warning documents.
&AtServer
Procedure SetExistingWarningDocuments()
	ThisObject.ListOfWarningDocuments.Parameters.SetParameterValue(
			"ConsolidatedRetailSales", ThisObject.ConsolidatedRetailSales);
	ThisObject.Items.ListOfWarningDocuments.Refresh();

	Query = New Query;
	Query.Text = ThisObject.ListOfWarningDocuments.QueryText;
	Query.SetParameter("ConsolidatedRetailSales", ThisObject.ConsolidatedRetailSales);
	WarningDocumentsAreExisted = Not Query.Execute().IsEmpty();
EndProcedure

&AtClient
Procedure DeleteDoc(Command)
	CurrentRow = Items.ListOfWarningDocuments.CurrentRow; // DocumentRef
	If Not CurrentRow = Undefined Then
		DeleteDocAtServer(CurrentRow);
	EndIf;
EndProcedure

// Delete doc at server.
// 
// Parameters:
//  DocumentRef - DocumentRef
&AtServer
Procedure DeleteDocAtServer(DocumentRef)
	DocumentObject = DocumentRef.GetObject();
	DocumentObject.SetDeletionMark(True);
	
	LoadSessionData();
	SetCurrentPage();
EndProcedure

&AtClient
Procedure EditDoc(Command)
	CurrentRow = Items.ListOfWarningDocuments.CurrentRow;
	
	Notify = New NotifyDescription("EditDocFinish", ThisObject);
	If TypeOf(CurrentRow) = Type("DocumentRef.RetailSalesReceipt") Then
		OpenForm("Document.RetailSalesReceipt.Form.DocumentForm", 
			New Structure("Key", CurrentRow), 
			ThisObject,
			UUID,,,
			Notify,
			FormWindowOpeningMode.LockWholeInterface);
	ElsIf TypeOf(CurrentRow) = Type("DocumentRef.RetailReturnReceipt") Then
		OpenForm("Document.RetailReturnReceipt.Form.DocumentForm", 
			New Structure("Key", CurrentRow), 
			ThisObject,
			UUID,,,
			Notify,
			FormWindowOpeningMode.LockWholeInterface);
	EndIf;
EndProcedure

// Edit document finish.
// 
// Parameters:
//  Result - Undefined
//  AddInfo - Undefined
&AtClient
Procedure EditDocFinish(Result, AddInfo) Export
	LoadSessionData();
	SetCurrentPage();
EndProcedure

#EndRegion

#Region CashBox

&AtServer
Procedure ReadCashOperations()
	CashTable.Clear();
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	RetailSalesReceipt.Ref,
	|	TRUE AS Sales
	|INTO tmpRefs
	|FROM
	|	Document.RetailSalesReceipt AS RetailSalesReceipt
	|WHERE
	|	RetailSalesReceipt.ConsolidatedRetailSales = &ConsolidatedRetailSales
	|
	|UNION ALL
	|
	|SELECT
	|	RetailReturnReceipt.Ref,
	|	FALSE AS Sales
	|FROM
	|	Document.RetailReturnReceipt AS RetailReturnReceipt
	|WHERE
	|	RetailReturnReceipt.ConsolidatedRetailSales = &ConsolidatedRetailSales
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	PaymentTypes.Ref
	|INTO tmpCashTypes
	|FROM
	|	Catalog.PaymentTypes AS PaymentTypes
	|WHERE
	|	PaymentTypes.Type = VALUE(Enum.PaymentTypes.Cash)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmpRefs.Sales AS Sales,
	|	R3050T_PosCashBalancesTurnovers.PaymentType AS PaymentType,
	|	SUM(CASE
	|		WHEN tmpRefs.Sales
	|			THEN R3050T_PosCashBalancesTurnovers.AmountTurnover
	|		ELSE -R3050T_PosCashBalancesTurnovers.AmountTurnover
	|	END) AS Amount
	|FROM
	|	tmpRefs AS tmpRefs
	|		INNER JOIN AccumulationRegister.R3050T_PosCashBalances.Turnovers(,, Recorder, Company = &Company
	|		AND Branch = &Branch
	|		AND PaymentType IN
	|			(SELECT
	|				tmpCashTypes.Ref
	|			FROM
	|				tmpCashTypes)) AS R3050T_PosCashBalancesTurnovers
	|		ON tmpRefs.Ref = R3050T_PosCashBalancesTurnovers.Recorder
	|GROUP BY
	|	tmpRefs.Sales,
	|	R3050T_PosCashBalancesTurnovers.PaymentType
	|
	|ORDER BY
	|	Sales DESC,
	|	PaymentType";
	
	Query.SetParameter("Company", ThisObject.Company);
	Query.SetParameter("Branch", ThisObject.Branch);
	Query.SetParameter("ConsolidatedRetailSales", ThisObject.ConsolidatedRetailSales);
	
	QuerySelection = Query.Execute().Select();
	While QuerySelection.Next() Do
		Record = CashTable.Add();
		Record.Operation = ?(QuerySelection.Sales, R().InfoMessage_Sales, R().InfoMessage_Returns);
		Record.PaymentType = QuerySelection.PaymentType;
		Record.AmountInBase = QuerySelection.Amount; 
	EndDo;
	
EndProcedure

&AtClient
Procedure CashTableAmountInRegisterOnChange(Item)
	SetCurrentPage();
EndProcedure

&AtClient
Procedure CashConfirmOnChange(Item)
	SetCurrentPage();
EndProcedure

#EndRegion

#Region Terminals

Procedure ReadTerminalOperations()
	TerminalTable.Clear();
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	RetailSalesReceipt.Ref,
	|	TRUE AS Sales
	|INTO tmpRefs
	|FROM
	|	Document.RetailSalesReceipt AS RetailSalesReceipt
	|WHERE
	|	RetailSalesReceipt.ConsolidatedRetailSales = &ConsolidatedRetailSales
	|
	|UNION ALL
	|
	|SELECT
	|	RetailReturnReceipt.Ref,
	|	FALSE AS Sales
	|FROM
	|	Document.RetailReturnReceipt AS RetailReturnReceipt
	|WHERE
	|	RetailReturnReceipt.ConsolidatedRetailSales = &ConsolidatedRetailSales
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	PaymentTypes.Ref
	|INTO tmpCardTypes
	|FROM
	|	Catalog.PaymentTypes AS PaymentTypes
	|WHERE
	|	PaymentTypes.Type = VALUE(Enum.PaymentTypes.Card)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmpRefs.Sales AS Sales,
	|	R3050T_PosCashBalancesTurnovers.PaymentType AS PaymentType,
	|	R3050T_PosCashBalancesTurnovers.PaymentTerminal AS PaymentTerminal,
	|	SUM(CASE
	|		WHEN tmpRefs.Sales
	|			THEN R3050T_PosCashBalancesTurnovers.AmountTurnover
	|		ELSE -R3050T_PosCashBalancesTurnovers.AmountTurnover
	|	END) AS Amount
	|FROM
	|	tmpRefs AS tmpRefs
	|		INNER JOIN AccumulationRegister.R3050T_PosCashBalances.Turnovers(,, Recorder, Company = &Company
	|		AND Branch = &Branch
	|		AND PaymentType IN
	|			(SELECT
	|				tmpCardTypes.Ref
	|			FROM
	|				tmpCardTypes)) AS R3050T_PosCashBalancesTurnovers
	|		ON tmpRefs.Ref = R3050T_PosCashBalancesTurnovers.Recorder
	|GROUP BY
	|	tmpRefs.Sales,
	|	R3050T_PosCashBalancesTurnovers.PaymentType,
	|	R3050T_PosCashBalancesTurnovers.PaymentTerminal
	|
	|ORDER BY
	|	Sales DESC,
	|	PaymentTerminal,
	|	PaymentType";
	
	Query.SetParameter("Company", ThisObject.Company);
	Query.SetParameter("Branch", ThisObject.Branch);
	Query.SetParameter("ConsolidatedRetailSales", ThisObject.ConsolidatedRetailSales);
	
	QuerySelection = Query.Execute().Select();
	While QuerySelection.Next() Do
		Record = TerminalTable.Add();
		Record.Operation = ?(QuerySelection.Sales, R().InfoMessage_Sales, R().InfoMessage_Returns);
		Record.PaymentType = QuerySelection.PaymentType;
		Record.PaymentTerminal = QuerySelection.PaymentType;
		Record.AmountInBase = QuerySelection.Amount; 
	EndDo;
	
EndProcedure

&AtClient
Procedure TerminalTableAmountInTerminalOnChange(Item)
	SetCurrentPage();
EndProcedure

&AtClient
Procedure TerminalConfirmOnChange(Item)
	SetCurrentPage();
EndProcedure

#EndRegion

#Region Balance

&AtServer
Procedure ReadBalanceData()

	Query = New Query;
	Query.Text =
	"SELECT
	|	R3010B_CashOnHandBalanceAndTurnovers.Currency,
	|	R3010B_CashOnHandBalanceAndTurnovers.AmountOpeningBalance,
	|	R3010B_CashOnHandBalanceAndTurnovers.AmountReceipt,
	|	R3010B_CashOnHandBalanceAndTurnovers.AmountExpense,
	|	R3010B_CashOnHandBalanceAndTurnovers.AmountClosingBalance
	|FROM
	|	AccumulationRegister.R3010B_CashOnHand.BalanceAndTurnovers(&OpeningDate,,,, Company = &Company
	|	AND Branch = &Branch
	|	AND Account = &Account
	|	AND Currency = &Currency
	|	AND CurrencyMovementType = &CurrencyMovementType) AS R3010B_CashOnHandBalanceAndTurnovers";
	
	Query.SetParameter("OpeningDate", ThisObject.OpeningDate);
	Query.SetParameter("Company", ThisObject.Company);
	Query.SetParameter("Branch", ThisObject.Branch);
	Query.SetParameter("Account", ThisObject.CashAccount);
	Query.SetParameter("Currency", ThisObject.Currency);
	Query.SetParameter("CurrencyMovementType", ChartsOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency);
	
	QuerySelection = Query.Execute().Select();
	If QuerySelection.Next() Then
		ThisObject.BalanceBegin = QuerySelection.AmountOpeningBalance;
		ThisObject.BalanceCashIn = QuerySelection.AmountReceipt;
		ThisObject.BalanceCashOut = QuerySelection.AmountExpense;
		ThisObject.BalanceEnd = QuerySelection.AmountClosingBalance; 
	EndIf;
	
EndProcedure	

&AtClient
Procedure BalanceRealOnChange(Item)
	SetCurrentPage();
EndProcedure

&AtClient
Procedure BalanceConfirmOnChange(Item)
	SetCurrentPage();
EndProcedure

#EndRegion
